# -*- coding: utf-8 -*-
'''
Задание 5.1a

Всё, как в задании 5.1. Но, если пользователь ввел адрес хоста, а не адрес сети,
то надо адрес хоста преобразовать в адрес сети и вывести адрес сети и маску, как в задании 5.1.

Пример адреса сети (все биты хостовой части равны нулю):
* 10.0.1.0/24
* 190.1.0.0/16

Пример адреса хоста:
* 10.0.1.1/24 - хост из сети 10.0.1.0/24
* 10.0.5.1/30 - хост из сети 10.0.5.0/30

Если пользователь ввел адрес 10.0.1.1/24,
вывод должен быть таким:

Network:
10        0         1         0
00001010  00000000  00000001  00000000

Mask:
/24
255       255       255       0
11111111  11111111  11111111  00000000

Проверить работу скрипта на разных комбинациях сеть/маска.

Ограничение: Все задания надо выполнять используя только пройденные темы.

'''

###

ip_mask = input('Введите IP-сети в формате CIDR (aa.bb.cc.dd/xx) ').split('/')
#ip_mask = '10.246.245.133/24'.split('/')
ipaddr = [int(i) for i in ip_mask[0].split('.')]

netmask = int(ip_mask[1])
binmask = '1'*netmask + '0'*(32 - netmask)
#byte_len = 8
octmask = [int(binmask[i-8:i], 2) for i in range(8, len(binmask)+1, 8)]

ip_bin = '{:08b}{:08b}{:08b}{:08b}'.format(*ipaddr)
ip_bin_net = ip_bin[:netmask] + '0'*(32 - netmask)
oct_ip_net = [int(ip_bin_net[i-8:i], 2) for i in range(8, len(ip_bin_net)+1, 8)]

out_net = ['Network:',
        '{0:<10}{1:<10}{2:<10}{3:<10}',
        '{0:08b}  {1:08b}  {2:08b}  {3:08b}']
out_mask = ['Mask:',
            '/{mask}',
            '{0:<10}{1:<10}{2:<10}{3:<10}',
            '{0:08b}  {1:08b}  {2:08b}  {3:08b}']

print('\n'.join(out_net).format(*oct_ip_net))
print('\n'.join(out_mask).format(*octmask, mask=netmask))