#!/usr/bin/python

#Дана строка, которая может содержать букву f.
#Напечатайте позицию первого и последнего вхождения f. Если буква f встречается только один раз, то
#выведите позицию один раз. Если буква f не встречается, напечатайте -1.
#Позиции букв в слове считайте с 0. Например, в слове hello буква h находится в позиции 0, буква e - в
#позиции 1, буква o - в позиции 4.

s = input()

#array = []
#if f not in s:
#    array = -1
#else:
#    for i in range(len(s)):
#        if s[i] != 'f':
#            continue
#        else:
#            array.append(i)
#            
#print(*array)

ff = s.find('f')
i = ff+1
#fl = ''

if 'f' in s[i:]:
    fl = s.rfind('f')
else:
    fl = ''

print(ff, fl)