#!/usr/bin/python

#Напишите код, который принимает значения основания и высоты прямоугольного треугольника и
#печатает его площадь. Каждое число принимается на отдельной строке

cat1 = int(input())
cat2 = int(input())
square = (cat1*cat2)/2
print(square)
