#!/usr/bin/python

#Напишите код, который принимает три целых числа и печатает их сумму.
#Каждое число принимаетсяна отдельной строке.

n1 = int(input())
n2 = int(input())
n3 = int(input())
n_sum = n1+n2+n3
print(n_sum)