#!/usr/bin/python

#Дана строка. Удалите все символы '@' из этой строки.
#Напечатайте изменённую строку

s = input()

sr = s.replace('@', '')

print(sr)

