#!/usr/bin/python

#Дана какая-то строка. Замените в этой строке все числа 1 словом 'one'.
#Напечатайте изменённую строку

s = input()

sr = s.replace('1', 'one')

print(sr)
